---
kind: type
id: T:Autodesk.Revit.DB.Lighting.InitialLuminousIntensity
source: html/8ca18b8f-437f-6159-30cc-ecbb97c41d70.htm
---
# Autodesk.Revit.DB.Lighting.InitialLuminousIntensity

This class encapsulates initial luminous intensity calculation.

## Syntax (C#)
```csharp
public class InitialLuminousIntensity : InitialIntensity
```